modules/controllers/UserController.php

SELECT COUNT(*) FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid`
SELECT * FROM `shop_profile` WHERE `userid`='1'
SELECT `shop_user`.* FROM `shop_user` LEFT JOIN `shop_profile` ON `shop_user`.`userid` = `shop_profile`.`userid` LIMIT 10
---
    public function actionUsers()
    {
        $model = User::find()->joinWith('profile');
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['user'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $users = $model->offset($pager->offset)->limit($pager->limit)->all();