models/Category.php

SELECT * FROM `shop_category`
---
    public function getData()
    {
        $cates = self::find()->all();