models/User.php

INSERT INTO `shop_user` (`username`, `useremail`, `userpass`, `createtime`) VALUES ('zhangsan123', 'zhangsan123@qq.con', '202cb962ac59075b964b07152d234b70', 1494937435)
---
    public function reg($data, $scenario = 'reg')
    {
        $this->scenario = $scenario;
        if ($this->load($data) && $this->validate()) {
            $this->createtime = time();
            $this->userpass = md5($this->userpass);
            if ($this->save(false)) {